app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "price", "amoun", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Monitor"], ["description", "Monitor 28\""], ["price", 499.99], ["amoun", 4], ["created_at", "2023-01-26 23:45:17.561268"], ["updated_at", "2023-01-26 23:45:17.561268"]]